app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
      cats = Cat.all

INSERT INTO "cats" ("name", "age", "image", "interests", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      cat = Cat.create(cat_params)